// Запросить у пользователя 10 чисел и подсчитать, сколько он ввел положительных, отрицательных и нулей. При этом также посчитать, сколько четных и нечетных. Вывести статистику на экран. Учтите, что достаточно одной переменной (не 10) для ввода чисел пользователем.

const a1 = a2 = a3 = a4 = a5 = a6 = a9 = a10 = +prompt('Put the namber')

// посчитать положительные

if (a > 0; a%2 === 0; ) {

 
} else if(a%2 === 0) {
  
} else if(a%2 !== 0) {

} else if (a < 0){

}
// посчитать отрицательные
// осчитать четных
// осчитать нечетных
// осчитать положительные
// осчитать положительные